# -*- coding: utf-8 -*-
import json
import numpy as np

def fund(x, a, b, c, d, scale=1):
    """
    拟合曲线方程
    是一个二项指数函数
    :param x:输入数据
    :param a:
    :param b:
    :param c:
    :param d:
    :param scale:这个参数是给行业拟合曲线来用的，因为行业拟合曲线是根据行业数据缩放得来的
    所以这个就是缩放值
    :return:
    拟合出的排名
    """
    return (a * np.exp(b * x) + c * np.exp(d * x)) * scale

# 60.6300000000	-0.0007853000	294.2000000000	-0.0121300000	0.9454339236
# a,b,c,d,s = 60.6300000000,-0.0007853000,294.2000000000,-0.0121300000,0.9454339236
# a1,b1,c1,d1 = 161.3255580000,-0.0049890000,56.2724740000,-0.0007040000,0.9820530000
a=60.6300000000
b=-0.0007853000
c=294.2000000000
d=-0.0121300000
s=0.9454339236
a1=161.3255580000
b1=-0.0049890000
c1=56.2724740000
d1=-0.0007040000
x = 1365
print fund(x,a,b,c,d,s)
print fund(x,a1,b1,c1,d1)
